[
    {
        "image" : "1200.jpg",
        "date" : "22/05/2025",
        "headline" : "Next Mid Essex Show - 15th June",
        "content" : "<p>Get ready for an electrifying night of action! Join us at Halstead Boxing Gym on 15th June 2025 for our next thrilling home boxing show, featuring all out most talented boxers. Experience the excitement ringside as talented local fighters go toe-to-toe in a series of adrenaline-pumping bouts.</p><p>Whether you're a boxing enthusiast or just looking for a great night out, this is an event you won't want to miss. Mark your calendars and come support our rising stars—see you at Halstead Boxing Gym!</p>"
    },
    {
        "image" : "1600.jpg",
        "date" : "18/05/2025",
        "headline" : "Radley Unlucky in Close Bout",
        "content" : "<p>The Bomber returned to action this evening, competing away on the Felixstowe show. Radley made an impressive start, forcing a count on his awkward southpaw opponent early in the first round. As the fight progressed, his opponent found his rhythm and likely edged the second round. With everything to fight for in the third, it was a closely contested bout right to the final bell. Ultimately, the decision went against Radley in a narrow 3-2 split, but he gave a strong account of himself and will be back in action soon.</p>"
    },
    {
        "image" : "1300.jpg",
        "date" : "18/05/2025",
        "headline" : "Strong Performance From Bayley",
        "content" : "<p>Bayley delivered an impressive performance on the Prince Regent show, securing a unanimous decision victory against a tough opponent. Although it was challenging to keep the shorter, powerful adversary at bay, Bayley showed great composure and skill, maintaining control throughout the fight and earning a well-deserved win. It's fantastic to see the progress Bayley has made in recent weeks, and we look forward to watching him back in action next week.</p?"
    },
    {
        "image" : "1400.jpg",
        "date" : "18/05/2025",
        "headline" : "Kenny Loses Split Decision",
        "content" : "<p>On a busy Friday evening for Mid Essex boxers, Kenny took to the ring on the Hornchurch and Elmpark show. The home crowd's support made for a lively atmosphere during a tightly contested opening round. Undeterred, Kenny came out firing in the second, dominating the action and showcasing a wide range of impressive skills. The third round was one of the most exciting we've seen all year, and we believed Kenny had done enough to secure the win. However, the split decision narrowly went the other way.</P> <p>There's no time to dwell on the result, though—Kenny will be back in action again next week.</p>"
    }
]